import UIKit
import Foundation

//Lesson ----- Импорт фреймворков или библиотек -----/

// фреймворк это такой каркас у которого ест ьмножество классов и методов и свойств. Внутри фреймворка можно найти множество протоколов.

// ----- чтобы посмотреть какие классы находяться внутри протоколов, нужно зайти на адрес https://developer.apple.com/reference/ ---------------

// ----- фреймворк нужен для того чтобы предложить готовый функционал разработчику для облегчения программирования приложения   ------------------

// ------ UIKit, Foundation - это фреймворки

// ------ deprecated - это классы в фреймворке которые уже устарели и они не будут использоваться в следующих iOS

// ------ фреймворк Alamofire для работы с сетью на Swift от сторонних разработчиков  https://github.com/Alamofire/Alamofire

let string = "Hello, World!"


// разбить строку на компоненты
string.components(separatedBy: " ")

